Repository: saliouseck2009/wolof_quran
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: Wolof Quran
ar: القرآن الولوف
fr: Coran Wolof

# welcome
source: Welcome to Wolof Quran
ar: مرحباً بكم في القرآن الولوف
fr: Bienvenue dans Coran Wolof

source: Quran
ar: القرآن
fr: Coran

source: Surah
ar: سورة
fr: Sourate

source: Ayah
ar: آية
fr: Verset

source: Play
ar: تشغيل
fr: Lire

source: Pause
ar: إيقاف مؤقت

source: Stop
ar: توقف
fr: Arrêter

source: Settings
ar: الإعدادات
fr: Paramètres

source: Language
ar: اللغة
fr: Langue

source: Theme
ar: المظهر
fr: Thème

source: Dark
ar: داكن
fr: Sombre

source: Light
ar: فاتح
fr: Clair

source: Arabic
ar: العربية
fr: Arabe

source: French
ar: الفرنسية
fr: Français

source: English
ar: الإنجليزية
fr: Anglais

source: Wolof
ar: الولوف

source: Search
ar: بحث
fr: Rechercher

source: Search in Quran
ar: البحث في القرآن
fr: Rechercher dans le Coran

source: Favorites
ar: المفضلة
fr: Favoris

source: Bookmarks
ar: العلامات المرجعية
fr: Signets

source: Recitation
ar: التلاوة
fr: Récitation

source: Translation
ar: الترجمة
fr: Traduction

# translationSettings
source: Translation
ar: إعدادات الترجمة
fr: Traduction

source: Select Translation
ar: اختر الترجمة
fr: Sélectionner la traduction

source: Current Translation
ar: الترجمة الحالية
fr: Traduction actuelle

source: Change Translation
ar: تغيير الترجمة
fr: Changer la traduction

# translationDescription
source: Choose your preferred translation for Quran verses and chapters
ar: اختر الترجمة المفضلة لآيات وسور القرآن
fr: Choisissez votre traduction préférée pour les versets et chapitres du Coran

# translationUpdated
source: Translation updated to {language}
ar: تم تحديث الترجمة إلى {language}
fr: Traduction mise à jour vers {language}

source: Quran Settings
ar: إعدادات القرآن
fr: Paramètres du Coran

source: Current
ar: الحالي
fr: Actuel

source: System
ar: النظام
fr: Système

source: Version
ar: الإصدار

source: Support
ar: الدعم

source: Rate App
ar: قيّم التطبيق
fr: Évaluer l'app

source: Get help
ar: احصل على المساعدة
fr: Obtenir de l'aide

# giveRating
source: Give your rating
ar: أعط تقييمك
fr: Donnez votre avis

source: Cancel
ar: إلغاء
fr: Annuler

source: Close
ar: إغلاق
fr: Fermer

# developedWithLove
source: Developed with ❤️ for the Muslim community
ar: طُور بـ ❤️ للمجتمع المسلم
fr: Développé avec ❤️ pour la communauté musulmane

source: Surahs
ar: السور
fr: Sourates

source: Search surah...
ar: البحث عن سورة...
fr: Rechercher une sourate...

source: verses
ar: آيات
fr: versets

source: Revelation
ar: النزول
fr: Révélation

source: Meccan
ar: مكية
fr: Mecquoise

source: Medinan
ar: مدنية
fr: Médinoise

source: No surah found
ar: لم توجد سورة
fr: Aucune sourate trouvée

# tryDifferentSearch
source: Try a different search term
ar: جرب مصطلح بحث مختلف
fr: Essayez un autre terme de recherche

# audioNotAvailable
source: Audio not available. Please download the surah first.
ar: الصوت غير متوفر. يرجى تحميل السورة أولاً.
fr: Audio non disponible. Veuillez d'abord télécharger la sourate.

# checkInternetConnection
source: Check your internet connection and try again
ar: تحقق من اتصالك بالإنترنت وحاول مرة أخرى
fr: Vérifiez votre connexion Internet et réessayez

# connectionTimeout
source: Connection timeout. Please try again
ar: انتهت مهلة الاتصال. يرجى المحاولة مرة أخرى
fr: Délai de connexion dépassé. Veuillez réessayer

# audioFileNotFound
source: Audio file not found on server
ar: لم يتم العثور على ملف الصوت على الخادم
fr: Fichier audio introuvable sur le serveur

# accessDeniedToAudio
source: Access denied to audio file
ar: تم رفض الوصول إلى ملف الصوت
fr: Accès refusé au fichier audio

# notEnoughStorage
source: Not enough storage space available
ar: مساحة التخزين غير كافية
fr: Espace de stockage insuffisant

# downloadFailed
source: Download failed. Please try again
ar: فشل التحميل. يرجى المحاولة مرة أخرى
fr: Échec du téléchargement. Veuillez réessayer

# dioStatus404
source: Audio for this chapter is not yet available. Please try again later.
ar: الصوت لهذا الفصل غير متوفر بعد. يرجى المحاولة مرة أخرى لاحقًا.
fr: L’audio de ce chapitre n’est pas encore disponible. Merci de réessayer plus tard

# surahsDownloaded
source: {count}/114 Surahs Downloaded
ar: {count}/114 سورة محملة
fr: {count}/114 Sourates téléchargées

source: Downloaded
ar: محملة
fr: Téléchargée

source: Not downloaded
ar: غير محملة
fr: Non téléchargée

source: Downloading...
ar: جاري التحميل...
fr: Téléchargement...

# downloadedSuccessfully
source: {surahName} downloaded successfully
ar: تم تحميل {surahName} بنجاح
fr: {surahName} téléchargée avec succès

# downloadFailedWithError
source: Download failed: {error}
ar: فشل التحميل: {error}
fr: Échec du téléchargement : {error}

source: Try Again
ar: حاول مرة أخرى
fr: Réessayer

# errorCheckingDownloadStatus
source: Error checking download status: {error}
ar: خطأ في فحص حالة التحميل: {error}
fr: Erreur lors de la vérification du statut de téléchargement : {error}

source: Check failed
ar: فشل الفحص
fr: Vérification échouée

source: Download to play
ar: تحميل للتشغيل
fr: Télécharger pour lire

source: Pause Surah
ar: إيقاف مؤقت للسورة
fr: Mettre en pause la Sourate

source: Resume Surah
ar: استئناف السورة
fr: Reprendre la Sourate

source: Play Surah
ar: تشغيل السورة
fr: Lire la Sourate

# arabicAndTranslation
source: Arabic & Translation
ar: العربية والترجمة
fr: Arabe et Traduction

source: Arabic Only
ar: العربية فقط
fr: Arabe Seulement

source: Translation Only
ar: الترجمة فقط
fr: Traduction Seulement

source: Font Settings
ar: إعدادات الخط
fr: Paramètres de Police

source: Ayah Font Size
ar: حجم خط الآيات
fr: Taille de Police des Versets

# fontSizeDescription
source: Adjust the size of Arabic text in verses
ar: تعديل حجم النص العربي في الآيات
fr: Ajuster la taille du texte arabe dans les versets

source: Small
ar: صغير
fr: Petit

source: Large
ar: كبير
fr: Grand

source: Share Ayah
ar: مشاركة الآية
fr: Partager le Verset

# customizeAndShare
source: Customize & Share
ar: تخصيص ومشاركة
fr: Personnaliser et Partager

source: Background Style
ar: نمط الخلفية
fr: Style d'Arrière-plan

source: Display Style
ar: نمط العرض
fr: Style d'Affichage

source: Share Image
ar: مشاركة الصورة
fr: Partager l'Image

source: Bookmark added
ar: تم إضافة الإشارة المرجعية
fr: Marque-page ajouté

source: Bookmark removed
ar: تم حذف الإشارة المرجعية
fr: Marque-page supprimé

# noBookmarksDescription
source: Bookmark your favorite verses to access them easily
ar: ضع إشارة مرجعية على آياتك المفضلة للوصول إليها بسهولة
fr: Marquez vos versets préférés pour y accéder facilement

# clearAllBookmarks
source: Clear All
ar: مسح الكل
fr: Tout effacer

# confirmClearBookmarks
source: Clear all bookmarks?
ar: مسح جميع الإشارات المرجعية؟
fr: Effacer tous les marque-pages ?

# clearBookmarksMessage
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.
fr: Cette action ne peut pas être annulée.

source: Clear
ar: مسح
fr: Effacer

# salamAlaikum
source: As-salamu alaykum
ar: السلام عليكم
fr: As-salam alaykum

# dailyInspirationTitle
source: Daily Inspiration
ar: إلهام يومي
fr: Inspiration quotidienne

source: Loading daily inspiration...
ar: جاري تحميل الإلهام اليومي...
fr: Chargement de l'inspiration quotidienne...

# holyQuran
source: The Holy Quran
ar: القرآن الكريم
fr: Le Noble Coran

# tapForDailyVerse
source: Tap to get your daily verse from the Quran
ar: اضغط للحصول على آيتك اليومية من القرآن
fr: Appuyez pour obtenir votre verset du jour du Coran

source: Tap anywhere to start
ar: اضغط في أي مكان للبدء
fr: Touchez n'importe où pour commencer

source: Tap to read Arabic & more
ar: اضغط لقراءة العربية والمزيد
fr: Appuyez pour lire l'arabe et plus

source: Open Surah
ar: افتح السورة
fr: Ouvrir la sourate

source: Bookmark
ar: إضافة إشارة مرجعية
fr: Marquer

source: Bookmarked
ar: مضاف إلى الإشارات المرجعية
fr: Marqué

source: Read Surahs
ar: قراءة السور
fr: Lire les sourates

source: Listen Audio
ar: استمع إلى الصوت
fr: Écouter l'audio

source: Find Verses
ar: ابحث عن الآيات
fr: Trouver des versets

source: Saved Ayahs
ar: الآيات المحفوظة
fr: Versets enregistrés

# settingsDescription
source: Customize your reading experience
ar: خصص تجربة القراءة الخاصة بك
fr: Personnalisez votre expérience de lecture

# changeAppLanguage
source: Change the app language
ar: تغيير لغة التطبيق
fr: Changer la langue de l'application

# chooseAppTheme
source: Choose the app theme
ar: اختيار مظهر التطبيق
fr: Choisir le thème de l'application

source: Manage preferences
ar: إدارة التفضيلات
fr: Gérer les préférences

source: About
ar: حول التطبيق
fr: À propos

# aboutSubtitle
source: App version and support
ar: إصدار التطبيق والدعم
fr: Version de l'application et support

# aboutDescription
source: An app to read the Quran and listen to recitations in Wolof.
ar: تطبيق لقراءة القرآن والاستماع إلى التلاوات باللغة الولوف.
fr: Une application pour lire le Coran et écouter les récitations en langue wolof.

# appVersion
source: Version {version}
ar: الإصدار {version}

# quranSettingsDescription
source: Customize your Quran reading experience
ar: خصص تجربة قراءة القرآن لديك
fr: Personnalisez votre lecture du Coran

# audioAndReciters
source: Audio & Reciters
ar: الصوت والقراء
fr: Audio et récitateur(s)

source: Manage reciters and download audio
ar: إدارة القراء وتنزيل الصوت
fr: Gérer les récitateur(s) et télécharger l'audio

source: View available reciters
ar: عرض القراء المتاحين
fr: Voir les récitateur(s) disponibles

source: Unknown
ar: غير معروف
fr: Inconnu

source: Available Reciters
ar: القراء المتاحون
fr: Récitateur(s) disponibles

source: Error loading reciters
ar: خطأ في تحميل القراء
fr: Erreur lors du chargement des récitateur(s)

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: No reciters available
ar: لا يوجد قراء متاحون
fr: Aucun récitateur disponible

# checkBackLaterReciters
source: Check back later for available reciters
ar: عد لاحقاً للاطلاع على القراء المتاحين
fr: Revenez plus tard pour voir les récitateur(s) disponibles

source: Select Reciter
ar: اختر قارئاً
fr: Sélectionner un récitateur

# browseAndSelectReciterHint
source: Tap card to browse • Tap select button to choose default
ar: اضغط على البطاقة للاستعراض • اضغط على الزر للتعيين كافتراضي
fr: Touchez la carte pour parcourir • Touchez le bouton pour définir par défaut

source: Default Reciter
ar: القارئ الافتراضي
fr: Récitateur par défaut

source: Available
ar: متاح
fr: Disponible

# selectedAsDefaultReciter
source: Selected {name} as default reciter
ar: تم اختيار {name} كقارئ افتراضي
fr: {name} sélectionné comme récitateur par défaut

source: Audio Downloads
ar: تنزيلات الصوت
fr: Téléchargements audio

source: No reciter selected
ar: لم يتم اختيار قارئ
fr: Aucun récitateur sélectionné

source: Change
ar: تغيير
fr: Changer

# ayahCountLabel
source: {count} ayahs
ar: {count} آية
fr: {count} verset(s)

# surahAudioDeleted
source: {surahName} audio removed
ar: تم حذف صوت سورة {surahName}
fr: Audio de {surahName} supprimé

# enterWordsToFindVerses
source: Enter words to find verses in the Quran
ar: أدخل كلمات للعثور على آيات في القرآن
fr: Saisissez des mots pour trouver des versets dans le Coran

source: Enter words to search...
ar: أدخل كلمات للبحث...
fr: Saisissez des mots à rechercher...

# foundOccurrences
source: Found {occurrences} occurrence(s) in {verses} verse(s)
ar: تم العثور على {occurrences} نتيجة في {verses} آية
fr: {occurrences} occurrence(s) trouvée(s) dans {verses} verset(s)

source: No Results Found
ar: لم يتم العثور على نتائج
fr: Aucun résultat trouvé

source: Search Error
ar: خطأ في البحث
fr: Erreur de recherche

source: Search Quran
ar: بحث في القرآن
fr: Rechercher dans le Coran

source: Search the Quran
ar: ابحث في القرآن
fr: Recherchez dans le Coran

source: Try different search terms
ar: جرّب مصطلحات بحث أخرى
fr: Essayez d'autres termes de recherche
